#include <stdio.h>
#include <stdlib.h>
#include <locale.h>
void main()
{
	setlocale (LC_ALL, "Rus");

	//5.	Дано значение температуры T в градусах Фаренгейта. Определить значение этой же температуры в градусах Цельсия. 
	// Температура по Цельсию TC и температура по Фаренгейту TF связаны следующим соотношением: TC = (TF − 32)·5/9

	int Tf = 0;

	printf ("Введите значение Tf по фаренгейту : \t");
	
	scanf ("%d", &Tf);
	
	int Tc = 0;
	Tc = (Tf - 32) * 5 / 9;
	
	printf ("Значение Tc = %d\n", Tc);



	////4.	Дано число A. Вычислить A15, используя две вспомогательные переменные и пять операций умножения. 
	//// Для этого последовательно находить A2, A3, A5, A10, A15. Вывести все найденные степени числа A.

	//int A = 0;
	//
	//printf ("Введите значение A : \t");
	//
	//scanf ("%d", &A);
	//
	//int A2 = 0;
	//A2 = A*A;
	//
	//printf ("Значение A2 = %d\n", A2);
	//
	//int A3 = 0;
	//A3 = A2*A;
	//
	//printf ("Значение A3 = %d\n", A3);
	//
	//int A5 = 0;
	//A5 = A2*A3;
	//
	//printf ("Значение A5 = %d\n", A5);
	//
	//int A10 = 0;
	//A10 = A5*A5;
	//
	//printf ("Значение A10 = %d\n", A10);

	//int A15 = 0;
	//A15 = A10*A5;
	//
	//printf ("Значение A15 = %d\n", A15);


	////3.	Дано число A. Вычислить A8, используя вспомогательную переменную и три операции умножения. 
	//// Для этого последовательно находить A2, A4, A8. Вывести все найденные степени числа A.

	//int A = 0;
	//
	//printf ("Введите значение A : \t");
	//scanf ("%d", &A);
	//
	//int A2 = 0;
	//A2 = A*A;
	//
	//printf ("Значение A2 = %d\n", A2);
	//
	//int A4 = 0;
	//A4 = A2*A2;
	//
	//printf ("Значение A4 = %d\n", A4);
	//
	//int A8 = 0;
	//
	//A8 = A4*A4;
	//
	//printf ("Значение A8 = %d\n", A8);


	//// 2.	Найти значение функции y = 4(x−3)6 − 7(x−3)3 + 2 при данном значении x.
	//
	//int x = 0;

	//printf("Введите значение х : \t");
	//scanf("%d", &x);

	//int y = 0;
	//y = 4 * ((x - 3) * (x - 3) * (x - 3) * (x - 3) * (x - 3) * (x - 3)) - 7 * ((x - 3) * (x - 3) * (x - 3)) + 2;

	//printf("Значение функции y = %d\n", y);	


	/*
	1.	Найти значение функции y = 3x6 −6x2 −7 при данном значении x.
	
	int x = 0;

	printf ("Введите значение х : \t");
	scanf("%d", &x);
	
	int y = 0;
	y = 3 * (x* x *x* x* x *x) - 6 * (x*x) - 7;

	printf ("Значение функции y = %d\n", y);*/
}
	